[
  {
    "routeId": "0.2",
    "distance": "0",
    "event": "Leave Caras Galadon after breakfast. Lembas, cloaksand rope are provided. Haldir guides the Fellowship south and east through rolling woodlands, which fall away toward the rivers"
  },
  {
    "routeId": "0.2",
    "distance": "10",
    "event": "Reach grassy lawn on the Silverlode just west of the Anduin. Practice paddling. Meet swan-ship of Celeborn and Galadriel. Lunch and gift-giving. Leave in 3 small boats"
  },
  {
    "routeId": "0.2",
    "distance": "14",
    "event": "DRIFT. Sweep around a bend, and high banks hide the light of Lorien"
  },
  {
    "routeId": "0.2",
    "distance": "100",
    "event": "Trees disappear. Begin to see withered downs on east at the north edge of the Brown Lands. Tall reedy plains on west. Can see west to hills and mountains"
  },
  {
    "routeId": "0.2",
    "distance": "103",
    "event": "Camp in flats north of the Field of Celebrant"
  },
  {
    "routeId": "0.2",
    "distance": "143",
    "event": "Reach North Undeep with stony beaches on east; gravel shoals in the water: go carefully"
  },
  {
    "routeId": "0.2",
    "distance": "150",
    "event": "River Limlight enters on west"
  },
  {
    "routeId": "0.2",
    "distance": "155",
    "event": "Boromir mutters to himself. Just at dusk, Sam spots Gollum on a log"
  },
  {
    "routeId": "0.2",
    "distance": "163",
    "event": "Camp on small eyot near western shore. Sam and Frodo watch. Gollum appears during Frodo's watch. Aragorn wakes. Watches until morning"
  },
  {
    "routeId": "0.2",
    "distance": "202",
    "event": "North edge of eastern South Undeep"
  },
  {
    "routeId": "0.2",
    "distance": "222",
    "event": "Reach the north edge of western South Undeep"
  },
  {
    "routeId": "0.2",
    "distance": "235",
    "event": "Leave at dusk. Paddle cautiously. Sky clears. Sam notices 'rind' of the new Moon"
  },
  {
    "routeId": "0.2",
    "distance": "260",
    "event": "Reach lowlands between downs and the Emyn Muil"
  },
  {
    "routeId": "0.2",
    "distance": "290",
    "event": "Banks grow stony. Hills north of the Emyn Muil rise on the east shore"
  },
  {
    "routeId": "0.2",
    "distance": "300",
    "event": "Hills also appear on the west. The river passes through \"low crumbling cliffs, and chimneys with grey weathered stone dark with ivy\""
  },
  {
    "routeId": "0.2",
    "distance": "314",
    "event": "They reach the higher Emyn Muil"
  },
  {
    "routeId": "0.2",
    "distance": "335",
    "event": "Late in day Legolas sees eagle"
  },
  {
    "routeId": "0.2",
    "distance": "347",
    "event": "Midnight. Sam hears racing water. North edge of the rapids of Sarn Gebir. ORC ATTACK. Reach western shore. Legolas shoots a Nazgul’s flying beast. Move upstream to a small shallow bay. Huddle in boats rest of the night"
  },
  {
    "routeId": "0.2",
    "distance": "368",
    "event": "The Argonath. Boats are swept through the narrow gap between"
  },
  {
    "routeId": "0.2",
    "distance": "369",
    "event": "Chasm of the Gates bends slightly to the west"
  },
  {
    "routeId": "0.2",
    "distance": "370",
    "event": "Pass out of the chasm into the lake: Nen Hithoel"
  },
  {
    "routeId": "0.2",
    "distance": "386",
    "event": "Aragorn leads them toward the west bank"
  },
  {
    "routeId": "0.2",
    "distance": "389",
    "event": "Reach the lawn of Parth Galen below Amon Hen. \"Rauros was calling with a great voice\""
  }
]